//==============================================================================
// Простейшая программа, осуществляющая чтение строки цифр во внутренний
// буфер, из которого эти символы выводятся в столбик
//==============================================================================

#include <stdio.h>
#include <string.h>

#define MAX_STR_SIZE 256

int main() {
  char buf[MAX_STR_SIZE];
  fgets(buf, MAX_STR_SIZE, stdin);

  int len = strlen(buf);
  // Тестовый вывод введенной строки
  printf("buf[%d] = %s\n", len, buf);

  for(int i = 0; i < len-1; ++i) {
    putchar(buf[i]);
    putchar('\n');
  }
}

