#ifndef __figure_circle__
#define __figure_circle__

//==============================================================================
// figure-circle.h - описание специализации фигуры как круга
//==============================================================================

#include "figure.h"
#include "circle.h"

//------------------------------------------------------------------------------
// Фигура - круг
Figure + { Circle circ; };

//------------------------------------------------------------------------------
// Ввод круга из файла
Input + {void circ;};

#endif // __figure_circle__
