#ifndef __figure_rectangle__
#define __figure_rectangle__

//==============================================================================
// figure-rectangle.h - описание специализации фигуры как прямоугольника
//==============================================================================

#include "rectangle.h"
#include "figure.h"

//------------------------------------------------------------------------------
// Фигура - прямоугольник
Figure + { Rectangle rect; };

//------------------------------------------------------------------------------
// Ввод прямоугольника из файла
Input + {void rect;};

#endif // __figure_rectangle__
