#ifndef __figure__
#define __figure__

//==============================================================================
// figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

//------------------------------------------------------------------------------
// структура, обобщающая фигуры
typedef struct Figure {} case{} Figure;

//------------------------------------------------------------------------------
// Расширяемый перечислимый тип, используемый для эволюционного расширения
// ввода данных из файлов
typedef struct Input {} case{} Input;

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
// void FigureIn<Figure *f>(FILE* file) = 0;

//------------------------------------------------------------------------------
// Обобщающая функция для вывода параметров фигуры
// void FigureOut<Figure *f>(FILE* file) = 0;

#endif // __figure__