// Проверка использования специализации и указателя на специализацию в
// качестве обычного формального параметра, размещаемого в круглых скобках.
// В настоящий момент компилятор на такой указатель выдает ошибку.

#include <stdio.h>

//==============================================================================
// Формирование обобщений и обобщающих функций
//==============================================================================
typedef struct Rectangle {int x, y;} Rectangle;
typedef struct Triangle {int a, b, c;} Triangle;

//------------------------------------------------------------------------------
// typedef struct Figure {} case {
//   Triangle t;
//   Rectangle r;
// } Figure;

typedef struct Figure {} case {} Figure;
Figure + {Triangle t;};
Figure + {Rectangle r;};

//------------------------------------------------------------------------------
// Полиморфнай функция вывода фигуры
void Print<Figure* f>() = 0;
// Вывод специализированного треугольника
void Print<Figure.t* f>() {
  printf("Triangle(%d,%d,%d)\n", f->t.a, f->t.b, f->t.c);
}
// Вывод специализированного прямоугольника
void Print<Figure.r* f>() {
  printf("Rectangle(%d,%d)\n", f->r.x, f->r.y);
}

//==============================================================================
// Формирование оболочек над обобщенными и специализированными параметрами
//==============================================================================
// Использование в качестве обычного параметра указателя на обобщение
void PrintGen(Figure* f) {
  Print<f>();
}

//------------------------------------------------------------------------------
// Прототип для использования указателя на специализацию как обычного параметра
void PrintSpecTrianPtr(Figure.t* f);
//------------------------------------------------------------------------------
// Использование указателя на специализированный треугольник
// как обычного параметра
void PrintSpecTrianPtr(Figure.t* f) {
  // Прямое отображение
  printf("Triangle(%d,%d,%d)\n", f->t.a, f->t.b, f->t.c);
  // Полиморфный вызов
  Print<f>();
}

//------------------------------------------------------------------------------
// Прототип для использования специализации по значениикак обычного параметра
void PrintSpecTrianVal(Figure.t f);
//------------------------------------------------------------------------------
// Использование специализированного треугольника по значению
// как обычного параметра
void PrintSpecTrianVal(Figure.t f) {
  // Прямое отображение
  printf("Triangle(%d,%d,%d)\n", f.t.a, f.t.b, f.t.c);
  // Полиморфный вызов
  Print<&f>();
}

//------------------------------------------------------------------------------
// Проверка возврата специализации по указателю
Figure.r ReturnRectPtr(Figure.r fr) {
  Figure.r r = fr;
  r.r.x = 100;
  return r;
}

//------------------------------------------------------------------------------
int main() {
  Figure.t t = {3,4,5};
  Figure.r r = {10,20};
  Figure.t t2 = t;

  // Корректные выводы
  Print<&t>();
  Print<&r>();
  Print<&t2>();

  Figure* f = &t;
  Print<f>();
  PrintGen(f);

  f = &r;
  Print<f>();
  PrintGen(f);

  PrintSpecTrianPtr(&t);
  PrintSpecTrianVal(t);

  Figure.r r2 = ReturnRectPtr(r);
  Print<&r2>();

  return 0;
}

// Разные варианты работают