#ifndef __figure_color__
#define __figure_color__

//==============================================================================
// figure-color.h - описание специализации фигуры как цвет + основа
//==============================================================================

#include "figure.h"
#include "rectangle.h"
#include "triangle.h"

typedef struct Color {
    unsigned int color; // цвет фигуры
} case{} Color; // Жесткая специализация декоратора как фигуры

//------------------------------------------------------------------------------
// Фигура - декоратор как специализация фигуры
Figure + { Color color; } ;

//------------------------------------------------------------------------------
// Формирование прямых специализаций декоратора
Color + {Rectangle rect;};
Color + {Triangle  trian;};

//------------------------------------------------------------------------------
// Ввод цветного прямоугольника из файла
Input + {void color_rect;};
// Ввод цветного треугольника из файла
Input + {void color_trian;};


#endif // __figure_color__
