#ifndef __figure_rectangle__
#define __figure_rectangle__

//==============================================================================
// figure-rectangle.h - описание специализации фигуры как прямоугольника
//==============================================================================

#include "figure.h"
#include "rectangle.h"

//------------------------------------------------------------------------------
// Фигура - прямоугольник
Figure + {Rectangle rect;};

#endif // __figure_rectangle__
