//==============================================================================
// Простейшая ПП программа, осуществляющая чтение строки цифр во внутренний
// буфер, из которого эти символы выводятся в столбик
//==============================================================================

#include <stdio.h>
#include <string.h>

#define MAX_STR_SIZE 256    // размер буфера строки

//------------------------------------------------------------------------------
// Интерфейс читателя цифр. Включает вспомогательные данные и функции
// помимо переопределяемой далее функции чтения строки.

typedef struct Reader {
  char* buf;
}<> Reader;

// Инициализация общей для всех читателей части.
// Осуществляетс связь с используемым буфером.
void InitReader(Reader* r, char* b) {
  r->buf = b;
  r->buf[0] = '\0';
}

// Получение указателя на буфер, подключенный к читателю
char* getBuf(Reader* r) {
  return r->buf;
}

// Обобщающая функция, переопределяемая конкретными читателями
void readDigStr<Reader* r>() = 0;

//------------------------------------------------------------------------------
// Читатель строки, допускающий на выходе любые символы, а не только цифры
Reader + <Bad: void;>;

// Переопределение функции чтения в буфер
void readDigStr<Reader.Bad* r>() {
  fgets(r->buf, MAX_STR_SIZE, stdin);
  r->buf[strlen(r->buf) - 1] = '\0';    // убрали `\n`
  printf("Bad reader string = %s\n", r->buf);
};

//------------------------------------------------------------------------------
// Читатель, оставляющий после прочтения только цифры
Reader + <Dig: void;>;

// Переопределение функции чтения в буфер
void readDigStr<Reader.Dig* r>() {
  fgets(r->buf, MAX_STR_SIZE, stdin);
  // Оставление только цифровых символов
  int len = strlen(r->buf);
  int j = 0;
  for(int i = 0; i < len; ++i) {
    if((r->buf[i] >= '0') && (r->buf[i] <= '9')) {
      r->buf[j++] = r->buf[i]; // Пропуск цифры
    }
  }
  r->buf[j] = '\0';    // конец цифровой строки
  printf("%s\n", r->buf);
}

//------------------------------------------------------------------------------
// Интерфейс принтеров, обрабатывающих цифры
typedef struct Printer {
  Reader* reader;
}<> Printer;

// Инициализация данных, общих для всех принтеров.
// Осуществляетс связь с используемым читателем.
void InitPrinter(Printer* p, Reader* r) {
  p->reader = r;
}

// Обобщающая функция отображения цифр
void outDigits<Printer* p>() = 0;

//------------------------------------------------------------------------------
// Принтер, печатающий цифры как есть
Printer + <Dig: void;>;

// Вывод цифр как есть
void outDigits<Printer.Dig* p>() {
  char* buf = getBuf(p->reader);
  int len = strlen(buf);
  for(int i = 0; i < len; ++i) {
    putchar(buf[i]);
    putchar('\n');
  }
}

//------------------------------------------------------------------------------
// Принтер, печатающий цифры и их названия
Printer + <Word: void;>;

// Массив названий, используемый для печати после сопоставления с цифрами
const char* wd[] = {
  "zero", "one", "two", "three", "four",
  "five", "six", "seven", "eight", "nine"
};

// Вывод названий цифр
void outDigits<Printer.Word* p>() {
    char* buf = getBuf(p->reader);
    int len = strlen(buf);
    for(int i = 0; i < len; ++i) {
      printf("%c: %s\n", buf[i], wd[buf[i]-'0']);
    }
  }

//------------------------------------------------------------------------------
// Тестовая функция демонстрирующая взаимодействие читателей строк и
// принтеров через абстрактные интерфейсы
int main() {
  // Буфер, используемый для строки
  char buf[MAX_STR_SIZE];

  // Абстрактные интерфейсы для подключения читателей строки и принтеров
  Reader* ir;
  Printer* ip;

  // Использования читателя, оставляющего в строке только цифры
  Reader.Dig dr; InitReader(&dr, buf);
  ir = &dr;
  printf("Input string for the good reader: ");
  readDigStr<ir>();

  Printer.Dig dp; InitPrinter(&dp, ir);
  ip = &dp;
  outDigits<ip>();

  Printer.Word wp; InitPrinter(&wp, ir);
  ip = &wp;
  outDigits<ip>();

  // Демонстрация плохого читателя, пропускающего не цифры
  Reader.Bad br; InitReader(&br, buf);
  ir = &br;
  printf("Input string for the bad reader: ");
  readDigStr<ir>();

  ip = &dp;
  outDigits<ip>();

  // Может упасть, если во водимой строке будут не только цифры
  ip = &wp;
  outDigits<ip>();

  return 0;
}

