#ifndef __draw_calc_area_client__
#define __draw_calc_area_client__

//==============================================================================
// draw-area-client.h - содержит интерфейс, поддерживающий клиента,
// осуществляющего вывод информации о фигурах и вычисление их площадей
// В этом клиенте реализация инкапсулирована.
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Прототип используемый для рисовани и вычисления площадей
void DrawAndCalcAreas(Container* c, FILE* ofst);

#endif // __draw_calc_area_client__