#ifndef __draw_calc_perimeter_client__
#define __draw_calc_perimeter_client__

//==============================================================================
// draw-perimeter-client.h - содержит интерфейс, поддерживающий клиента,
// осуществляющего вывод информации о фигурах и вычисление их периметров
// В этом клиенте реализация инкапсулирована.
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Прототип используемый для рисования и вычисления периметров
void DrawAndCalcPerimeters(Container* c, FILE* ofst);

#endif // __draw_calc_perimeter_client__