#ifndef __container__
#define __container__

//==============================================================================
// container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// В chibippc просто ссылка уже не проходит. Идет более строкая проверка
// Поэтому вместо нее подключаю непосредственно обобщение
// struct Figure;
#include "figure.h"

enum {max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct Container {
  int len; // текущая длина
  struct Figure *cont[max_len];
} Container;

#endif // __container__