//==============================================================================
// container-constr.c - содержит процедуры
// начальной инициализации и очистки (утилизации) контейнера
//==============================================================================

#include <stdlib.h>
#include "container.h"

// Удаление разнородных фигур
void FigureDestroy<Figure *f>();

//------------------------------------------------------------------------------
// Инициализация контейнера
void ContainerInit(Container *c) {
  c->len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void ContainerClear(Container *c) {
  for(int i = 0; i < c->len; i++) {
    // Вместо прямой очистки памяти для однородных обобщений
    // используется полиморфное удаление неоднородных фигур
    FigureDestroy<c->cont[i]>();
  }
  ContainerInit(c);
}
