//==============================================================================
// figure-triangle-out.c - Обработчик специализации, осуществляющий
// вывод треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип обобщеннай функции вывода фигуры
void FigureOut<Figure *f>(FILE* ofst);

//------------------------------------------------------------------------------
// Вывод треугольника как фигуры
void FigureOut<Figure.trian *f>(FILE* ofst) {
  fprintf(ofst, "It is Triangle: a = %d, b = %d, c = %d\n", f->trian.a, f->trian.b, f->trian.c);
}
