//==============================================================================
// Полиморфная функция удаления фигур, созданных динамически.
// Необходимо из-за того, что подключение основ специализаций в разных
// специализациях осуществляется по разному.
//==============================================================================

#include <stdlib.h>
#include "figure.h"
#include "figure-circle.h"

//------------------------------------------------------------------------------
// Обобщенная функция перекрывает все ситуации, когда фигура состоит только
// из головной части
void FigureDestroy<Figure* f>() {
  free(f);
}

//------------------------------------------------------------------------------
// Уникальным является удаление спеиализации круга, состоящего из обобщения и
// динамически подключаемой основы.
void FigureDestroy<Figure.circ* f>() {
  free(f->circ);
  free(f);
}
