//==============================================================================
// figure-triangle-in.c - Обработчик специализации, осуществляющий
// ввод треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип обобщеннай функции вывода фигуры
void FigureIn<Figure *f>(FILE* ifst);

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureIn<Figure.trian *f>(FILE* ifst) {
  fscanf(ifst, "%d", &(f->trian.a));
  fscanf(ifst, "%d", &(f->trian.b));
  fscanf(ifst, "%d", &(f->trian.c));
}
